Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляФормыСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъектаМетаданных</Name>
							<Comment>Полное имя объекта метаданных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИмяРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПользовательскиеНастройкиДоступаКОбработкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПользовательскиеНастройкиДоступаКОбработкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доступно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОтчетИлиОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСвязанныхОбъектов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РежимОтладки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВызоваДополнительныхОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыВызоваДополнительныхОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВызовКлиентскогоМетода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВызовСерверногоМетода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеФормы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДополнительныеОтчетыИОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрацияОбработки = Ложь;
	
	Если Объект.Ссылка = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка() Тогда
		ЭтоНовый = Истина;
	Иначе
		ЭтоНовый = Ложь;
		Если ДополнительныеОтчетыИОбработки.ПроверитьНазначаемаяОбработка(Объект.Вид) Тогда
			ПолноеНазначениеЗначение = ДополнительныеОтчетыИОбработки.ПолучитьПолноеНазначениеПоВидуДополнительнойВнешнейОбработки(Объект.Вид);
			ЗначениеВРеквизитФормы(ПолноеНазначениеЗначение, "ПолноеНазначение");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьКоманды();
	
	УстановитьЭлементыФормы();
	
	ВидДополнительныйОтчет = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет;
	ВидОтчет = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоНовый Тогда
		
		Если НЕ ОткрытьДиалогЗагрузкиФайлаОбработкиОтчета(Истина) Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборОбъектовМетаданных" Тогда
		
		Объект.Назначение.Очистить();
		
		Для Каждого ЭлементПараметр Из Параметр Цикл
			
			// поиск переданного назначения в полном возможном назначении
			НайденныеСтроки = ПолноеНазначение.НайтиСтроки(Новый Структура("ПолноеИмяОбъектаМетаданных", ЭлементПараметр.Значение));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НовоеНазначение = Объект.Назначение.Добавить();
				НовоеНазначение.ПолноеИмяОбъектаМетаданных = ЭлементПараметр.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресДанныхОбработки = ПоместитьВоВременноеХранилище(ТекущийОбъект.ХранилищеОбработки.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если РегистрацияОбработки Тогда
		ДвоичныеДанныеОбработки = ПолучитьИзВременногоХранилища(АдресДанныхОбработки);
		ТекущийОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОбработки , Новый СжатиеДанных(9));
		РегистрацияОбработки = Ложь;
	КонецЕсли;
	
	Если    Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка
		ИЛИ Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("КомандыОбработки", РеквизитФормыВЗначение("КомандыОбработки"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовый = Ложь;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ДополнительныеОтчетыИОбработки.ПроверитьНазначаемаяОбработка(Объект.Вид) Тогда
		
		Если НЕ Объект.ИспользоватьДляФормыОбъекта И НЕ Объект.ИспользоватьДляФормыСписка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Необходимо указать использование обработки, как минимум для одной формы';uk=' Необхідно вказати використання обробки, як мінімум для однієї форми'"),,,"Объект.ИспользоватьДляФормыОбъекта", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ КомандыОбработки

&НаКлиенте
Процедура КомандыОбработкиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыИспользование Тогда
		
		Если НЕ Элемент.ТекущиеДанные.Разрешено Тогда
			
			Отказ = Истина;
			Предупреждение(
				НСтр("ru='Команда используется только на клиенте."
"Регламентное задание можно настраивать только для команд исполняемых в серверном контексте.';uk='Команда використовується тільки на клієнтові. Регламентне завдання можна набудовувати тільки для команд, що виконуються в серверному контексті.'")
			);
		ИначеЕсли Элемент.ТекущиеДанные.РасписаниеПредставление = стрРасписаниеНеЗадано()Тогда
			
			УстановитьРасписание(Элементы.КомандыОбработки.ТекущиеДанные, Отказ);
			
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыРасписание Тогда
		
		Если НЕ Элемент.ТекущиеДанные.Разрешено Тогда
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.КомандыОбработки.ПодчиненныеЭлементы.БыстрыйДоступПредставление Тогда
		
		НастроитьБыстрыйДоступОбщийОбработчик(Элемент.ТекущиеДанные);
		Отказ = Истина;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыРасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.КомандыОбработки.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРасписание(ТекущиеДанные);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗагрузитьФайлОбработкиОтчета(Команда)
	
	ОткрытьДиалогЗагрузкиФайлаОбработкиОтчета(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлОбработкиОтчета(Команда)
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресДанныхОбработки) Тогда
		Предупреждение(НСтр("ru='Нет данных для обработки.';uk='Немає даних для обробки.'"));
		Возврат;
	КонецЕсли;
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла = Объект.ИмяФайла;
		ДиалогСохраненияФайла.Фильтр = ДополнительныеОтчетыИОбработкиКлиентСервер.ФильтрДиалоговВыбораИСохранения();
		ДиалогСохраненияФайла.ИндексФильтра = ?(Объект.Вид = ВидДополнительныйОтчет ИЛИ Объект.Вид = ВидОтчет, 0, 1);
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок = НСтр("ru='Укажите файл';uk='Укажіть файл'");
		
		Если ДиалогСохраненияФайла.Выбрать() Тогда
			ПолучаемыеФайлы = Новый Массив;
			ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(, АдресДанныхОбработки));
			ПолученныеФайлы = Новый Массив;
			ПолучитьФайлы(ПолучаемыеФайлы, ПолученныеФайлы, ДиалогСохраненияФайла.ПолноеИмяФайла, Ложь);
		КонецЕсли;
		
	Иначе
		
		ПолучитьФайл(АдресДанныхОбработки, Объект.ИмяФайла, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьНазначениеОбработки(Команда)
	
	ФильтрПоОбъектамМетаданных = ПолучитьФильтрПоОбъектамМетаданных(Объект.Вид);
	
	ВыбранныеОбъектыМетаданных = Новый СписокЗначений;
	
	Для Каждого ЭлементНазначение ИЗ Объект.Назначение Цикл
		ВыбранныеОбъектыМетаданных.Добавить(ЭлементНазначение.ПолноеИмяОбъектаМетаданных);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ФильтрПоОбъектамМетаданных", ФильтрПоОбъектамМетаданных);
	ПараметрыФормы.Вставить("ВыбранныеОбъектыМетаданных", ВыбранныеОбъектыМетаданных);
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеКоманды(Команда)
	
	ТекущиеДанные = Элементы.КомандыОбработки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Разрешено Тогда
		Отказ = Ложь;
		УстановитьРасписание(ТекущиеДанные, Отказ);
		Если НЕ Отказ Тогда
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		Предупреждение(НСтр("ru='Команда используется только на клиенте."
"Регламентное задание можно настраивать только для команд исполняемых в серверном контексте.';uk='Команда використовується тільки на клієнтові. Регламентне завдання можна набудовувати тільки для команд, що виконуються в серверному контексті.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьРазделыКомандногоИнтерфейса(Команда)
	
	Разделы = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы Из Объект.Разделы Цикл
		Разделы.Добавить(СтрокаТаблицы.Раздел);
	КонецЦикла;
	
	СписокРазделов = ОткрытьФормуМодально(
		"Справочник.ДополнительныеОтчетыИОбработки.Форма.ПодборРазделов",
		Новый Структура("Разделы,ВидОбработки", Разделы, Объект.Вид)
	);
	
	Если ТипЗнч(СписокРазделов) = Тип("СписокЗначений") Тогда
		Объект.Разделы.Очистить();
		Для Каждого ЭлементСписка Из СписокРазделов Цикл
			НоваяСтрока = Объект.Разделы.Добавить();
			НоваяСтрока.Раздел = ЭлементСписка.Значение;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьБыстрыйДоступ(Команда)
	
	ТекущиеДанные = Элементы.КомандыОбработки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьБыстрыйДоступОбщийОбработчик(ТекущиеДанные);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьФильтрПоОбъектамМетаданных(ВидОбработки)
	ФильтрПоОбъектамМетаданных = Новый СписокЗначений;
	
	Если ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
		ОбщаяКоманда = Метаданные.ОбщиеКоманды.ДополнительныеОтчетыИОбработкиЗаполнениеОбъекта;
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
		ОбщаяКоманда = Метаданные.ОбщиеКоманды.ДополнительныеОтчетыИОбработкиОтчеты;
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма Тогда
		ОбщаяКоманда = Метаданные.ОбщиеКоманды.ДополнительныеОтчетыИОбработкиПечатныеФормы;
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.СозданиеСвязанныхОбъектов Тогда
		ОбщаяКоманда = Метаданные.ОбщиеКоманды.ДополнительныеОтчетыИОбработкиСозданиеСвязанныхОбъектов;
	КонецЕсли;
	
	Для Каждого ТипПараметраКоманды Из ОбщаяКоманда.ТипПараметраКоманды.Типы() Цикл
		ФильтрПоОбъектамМетаданных.Добавить(Метаданные.НайтиПоТипу(ТипПараметраКоманды).ПолноеИмя());
	КонецЦикла;
	
	Возврат ФильтрПоОбъектамМетаданных;
КонецФункции

&НаСервере
Функция ЗарегистрироватьОбработку(ПараметрыРегистрации)
	// Получает файл обработки из временного хранилища, пытается создать объект
	// обработки (внешнего отчета) и получает информацию из объекта внешней обработки (отчета)
	
	Если ПараметрыРегистрации.ОтключатьКонфликтующие = Истина Тогда
		Для Каждого ЭлементСписка Из ПараметрыРегистрации.Конфликтующие Цикл
			КонфликтующийОбъект = ЭлементСписка.Значение.ПолучитьОбъект();
			КонфликтующийОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки;
			КонфликтующийОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Результат = Новый Структура("ИмяОбъекта, СтароеИмяОбъекта, Успешно, ИмяОбъектаЗанято, Конфликтующие, КраткоеПредставлениеОшибки");
	Результат.ИмяОбъектаЗанято = Ложь;
	Результат.Успешно = Ложь;
	Результат.СтароеИмяОбъекта = ?(ЭтоНовый, Объект.ИмяОбъекта, Объект.Ссылка.ИмяОбъекта);
	
	// Подключение и получение имени, под которым объект будет подключаться
	Менеджер = ?(ПараметрыРегистрации.ЭтоОтчет, ВнешниеОтчеты, ВнешниеОбработки);
	Результат.ИмяОбъекта = СокрЛП(Менеджер.Подключить(АдресДанныхОбработки, , Истина));
	
	// Если отчет публикуется, то необходим контроль уникальности имени объекта, 
	//     под которым дополнительный отчет регистрируется в системе
	Если Объект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется Тогда
		// Проверка имени
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДОиО.Ссылка,
		|	ДОиО.Представление
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДОиО
		|ГДЕ
		|	ДОиО.ИмяОбъекта = &ИмяОбъекта
		|	И &УсловиеДопОтчет
		|	И ДОиО.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)
		|	И ДОиО.ПометкаУдаления = ЛОЖЬ
		|	И ДОиО.Ссылка <> &Ссылка";
		
		ВидыДопОтчетов = Новый Массив;
		ВидыДопОтчетов.Добавить(ВидДополнительныйОтчет);
		ВидыДопОтчетов.Добавить(ВидОтчет);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИмяОбъекта",     Результат.ИмяОбъекта);
		Запрос.УстановитьПараметр("ВидыДопОтчетов", ВидыДопОтчетов);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Если ПараметрыРегистрации.ЭтоОтчет Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДопОтчет", "ДОиО.Вид В (&ВидыДопОтчетов)");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДопОтчет", "НЕ ДОиО.Вид В (&ВидыДопОтчетов)");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		УстановитьПривилегированныйРежим(Истина);
		Конфликтующие = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Конфликтующие.Количество() > 0 Тогда
			Результат.ИмяОбъектаЗанято = Истина;
			Результат.Конфликтующие = Новый СписокЗначений;
			Для Каждого СтрокаТаблицы Из Конфликтующие Цикл
				Результат.Конфликтующие.Добавить(СтрокаТаблицы.Ссылка, СтрокаТаблицы.Представление);
			КонецЦикла; 
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	// Получение сведений о внешней обработке
	ВнешняяОбработка = Менеджер.Создать(Результат.ИмяОбъекта);
	
	Попытка
		РегистрационныеДанные = ВнешняяОбработка.СведенияОВнешнейОбработке();
	Исключение
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка получения сведений о внешней обработке ""%1"" при ее загрузке:';uk='Помилка одержання відомостей про зовнішню обробку ""%1"" при її завантаженні:'"),
			ПараметрыРегистрации.ИмяФайла
		) + Символы.ПС;
		Если Не ЭтоНовый Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru='Дополнительные отчеты и обработки';uk='Додаткові звіти й обробки'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ДополнительныеОтчетыИОбработки,
				Объект.Ссылка,
				Префикс + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецЕсли;
		Результат.КраткоеПредставлениеОшибки = Префикс + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Если РегистрационныеДанные.БезопасныйРежим
		ИЛИ Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
		// ничего не делаем
	Иначе
		Результат.КраткоеПредставлениеОшибки = НСтр("ru='Для добавления обработок запускаемых в небезопасном режиме требуются полные права.';uk=' Для додавання обробок, що запускаються в небезпечному режимі потрібні повні права.'");
		Возврат Результат;
	КонецЕсли;
	
	Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок[РегистрационныеДанные.Вид];
	Если ПараметрыРегистрации.ЭтоОтчет <> (Вид = ВидДополнительныйОтчет ИЛИ Вид = ВидОтчет) Тогда
		Результат.КраткоеПредставлениеОшибки = НСтр("ru='Вид обработки, указанный в сведениях о внешней обработке, не соответствует её расширению.';uk='Вид обробки, зазначений у відомостях про зовнішню обробку, не відповідає її розширенню.'");
		Возврат Результат;
	КонецЕсли;
	
	// Инициализация сведений об обработке
	ОбъектЗначение = РеквизитФормыВЗначение("Объект");
	ОбъектЗначение.Наименование		= РегистрационныеДанные.Наименование;
	ОбъектЗначение.Версия			= РегистрационныеДанные.Версия;
	ОбъектЗначение.БезопасныйРежим	= РегистрационныеДанные.БезопасныйРежим;
	ОбъектЗначение.Информация		= РегистрационныеДанные.Информация;
	ОбъектЗначение.ИмяФайла         = ПараметрыРегистрации.ИмяФайла;
	ОбъектЗначение.ИмяОбъекта       = Результат.ИмяОбъекта;
	
	// Загружена другая обработка (изменилось имя объекта или вид обработки)
	Если Объект.ИмяОбъекта <> Результат.ИмяОбъекта ИЛИ Объект.Вид <> Вид Тогда
		ОбъектЗначение.Назначение.Очистить();
		ОбъектЗначение.Вид = Вид;
	КонецЕсли;
	
	// Если не заполнено назначение - устанавливаем назначение из обработки
	Если 
		(
			ЭтоНовый 
			ИЛИ ОбъектЗначение.Назначение.Количество() = 0
		)
		И (
			ОбъектЗначение.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта
			ИЛИ ОбъектЗначение.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет
			ИЛИ ОбъектЗначение.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма
			ИЛИ ОбъектЗначение.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.СозданиеСвязанныхОбъектов
		) Тогда
		
		ОбъектЗначение.ИспользоватьДляФормыОбъекта = Истина;
		ОбъектЗначение.ИспользоватьДляФормыСписка = Истина;
		
		ПолноеНазначениеЗначение = ДополнительныеОтчетыИОбработки.ПолучитьПолноеНазначениеПоВидуДополнительнойВнешнейОбработки(ОбъектЗначение.Вид);
		
		Если РегистрационныеДанные.Свойство("Назначение") Тогда
			
			Для Каждого ЭлементЗаданноеНазначение Из РегистрационныеДанные.Назначение Цикл
				
				РазделеннаяСтрока = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЭлементЗаданноеНазначение, ".");
				
				Если РазделеннаяСтрока[1] = "*" Тогда
					
					НайденныеНазначения = ПолноеНазначениеЗначение.НайтиСтроки(Новый Структура("Класс", РазделеннаяСтрока[0]));
					
					Для Каждого ЭлементНайденноеНазначение Из НайденныеНазначения Цикл
						НоваяСтрока = ОбъектЗначение.Назначение.Добавить();
						НоваяСтрока.ПолноеИмяОбъектаМетаданных = ЭлементНайденноеНазначение.ПолноеИмяОбъектаМетаданных;
					КонецЦикла;
					
				Иначе
					
					Если ПолноеНазначениеЗначение.НайтиСтроки(Новый Структура("ПолноеИмяОбъектаМетаданных", ЭлементЗаданноеНазначение)).Количество() > 0 Тогда
						НоваяСтрока = ОбъектЗначение.Назначение.Добавить();
						НоваяСтрока.ПолноеИмяОбъектаМетаданных = ЭлементЗаданноеНазначение;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		ОбъектЗначение.Назначение.Свернуть("ПолноеИмяОбъектаМетаданных", "");
		
		ЗначениеВРеквизитФормы(ПолноеНазначениеЗначение, "ПолноеНазначение");
		
	КонецЕсли;
	
	КомандыСохраненные = ОбъектЗначение.Команды.Выгрузить();
	
	ОбъектЗначение.Команды.Очистить();
	
	// Инициализация команд
	
	Для Каждого ЭлементОписаниеКоманды Из РегистрационныеДанные.Команды Цикл
		
		НоваяСтрока = ОбъектЗначение.Команды.Добавить();
		НоваяСтрока.Идентификатор	= ЭлементОписаниеКоманды.Идентификатор;
		НоваяСтрока.Представление	= ЭлементОписаниеКоманды.Представление;
		НоваяСтрока.Модификатор		= ЭлементОписаниеКоманды.Модификатор;
		НоваяСтрока.ПоказыватьОповещение = ЭлементОписаниеКоманды.ПоказыватьОповещение;
		
		Если ЭлементОписаниеКоманды.Использование = "ОткрытиеФормы" Тогда
			НоваяСтрока.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы;
		ИначеЕсли ЭлементОписаниеКоманды.Использование = "ВызовКлиентскогоМетода" Тогда
			НоваяСтрока.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода;
		ИначеЕсли ЭлементОписаниеКоманды.Использование = "ВызовСерверногоМетода" Тогда
			НоваяСтрока.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода;
		Иначе
			ТекстСообщения = НСтр("ru='Для команды %1 не определен способ запуска.';uk=' Для команди %1 не визначений спосіб запуску.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЭлементОписаниеКоманды.Представление);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектЗначение.Ответственный = Пользователи.ТекущийПользователь();
	
	ЗначениеВРеквизитФормы(ОбъектЗначение, "Объект");
	
	УстановитьЭлементыФормы(Истина);
	
	ЗаполнитьКоманды(КомандыСохраненные);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьКоманды(КомандыСохраненные = Неопределено)
	
	КомандыОбработки.Очистить();
	
	Для Каждого ЭлементКоманда Из Объект.Команды Цикл
		
		НоваяКоманда = КомандыОбработки.Добавить();
		
		НоваяКоманда.Представление = ЭлементКоманда.Представление;
		НоваяКоманда.Идентификатор = ЭлементКоманда.Идентификатор;
		
		Если    Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка
			ИЛИ Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Регистр.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ПользовательскиеНастройкиДоступаКОбработкам КАК Регистр
			|ГДЕ
			|	Регистр.ДополнительныйОтчетИлиОбработка = &Ссылка
			|	И Регистр.ИдентификаторКоманды = &ИдентификаторКоманды
			|	И Регистр.Доступно";
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			Запрос.УстановитьПараметр("ИдентификаторКоманды", ЭлементКоманда.Идентификатор);
			Запрос.Текст = ТекстЗапроса;
			
			УстановитьПривилегированныйРежим(Истина);
			
			МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
			НоваяКоманда.БыстрыйСписокДоступа.ЗагрузитьЗначения(МассивПользователей);
			НоваяКоманда.БыстрыйДоступПредставление = ПредставлениеБыстрогоДоступаПользователей(
				НоваяКоманда.БыстрыйСписокДоступа.Количество()
			);
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Если Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка
			И ЭлементКоманда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода Тогда
			
			// Можно задавать расписание и указывать использование
			НоваяКоманда.Разрешено = Истина;
			
			РегламентноеЗаданиеЗадано = Ложь;
			
			Если КомандыСохраненные = Неопределено Тогда
				// загрузка команд из таблицы объекта
				РегламентноеЗаданиеGUID = ЭлементКоманда.РегламентноеЗаданиеGUID;
			Иначе
				
				НайденнаяСтрока = КомандыСохраненные.Найти(ЭлементКоманда.Идентификатор, "Идентификатор");
				
				Если НайденнаяСтрока = Неопределено Тогда
					// соответствия не найдено
				Иначе
					РегламентноеЗаданиеGUID = НайденнаяСтрока.РегламентноеЗаданиеGUID;
					КомандыСохраненные.Удалить(НайденнаяСтрока);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РегламентноеЗаданиеGUID) Тогда
				
				РегламентноеЗадание = ДополнительныеОтчетыИОбработки.НайтиРегламентноеЗадание(РегламентноеЗаданиеGUID);
				
				Если РегламентноеЗадание = Неопределено Тогда
					
					ЭлементКоманда.РегламентноеЗаданиеGUID = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
					
				Иначе
					
					ЭлементКоманда.РегламентноеЗаданиеGUID = РегламентноеЗаданиеGUID;
					
					НоваяКоманда.РасписаниеПредставление = Строка(РегламентноеЗадание.Расписание);
					НоваяКоманда.Использование	= РегламентноеЗадание.Использование;
					НоваяКоманда.Расписание.Добавить(РегламентноеЗадание.Расписание);
					
					РегламентноеЗаданиеЗадано = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ РегламентноеЗаданиеЗадано Тогда
				НоваяКоманда.РасписаниеПредставление = стрРасписаниеНеЗадано();
				НоваяКоманда.Использование	= Ложь;
			КонецЕсли;
			
		Иначе
			НоваяКоманда.РасписаниеПредставление = НСтр("ru='Не применимо - команда используется только на клиенте';uk='Не застосовне - команда використовується тільки на клієнтові'");
			НоваяКоманда.Использование	= Ложь;
			НоваяКоманда.Разрешено		= Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементыФормы(Регистрация = Ложь)
	
	Если Регистрация ИЛИ ЗначениеЗаполнено(Объект.Ссылка)Тогда
		
		Если Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка 
		 ИЛИ Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
					
			Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыРасписание.Видимость = Истина;
			Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыИспользование.Видимость = Истина;
			
			Элементы.СтраницыРазделыНазначение.ТекущаяСтраница =
				Элементы.СтраницаРазделы;
			
		ИначеЕсли ДополнительныеОтчетыИОбработки.ПроверитьНазначаемаяОбработка(Объект.Вид) Тогда
			
			Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыРасписание.Видимость = Ложь;
			Элементы.КомандыОбработки.ПодчиненныеЭлементы.КомандыИспользование.Видимость = Ложь;
			
			Элементы.СтраницыРазделыНазначение.ТекущаяСтраница =
				Элементы.СтраницаНазначение;
				
			Элементы.КомандыОбработкиНастроитьБыстрыйДоступККоманде.Видимость = Ложь;
			Элементы.КомандыОбработкиНастроитьРасписаниеКоманды.Видимость = Ложь;
			
			Элементы.КомандыОбработки.ПодчиненныеЭлементы.БыстрыйДоступПредставление.Видимость = Ложь;
			
		КонецЕсли;
		
		Если Объект.БезопасныйРежим Тогда
			Элементы.ГруппаДополнительнаяИнформация.ТекущаяСтраница = 
					Элементы.ГруппаИнформация;
		Иначе
			Элементы.ГруппаДополнительнаяИнформация.ТекущаяСтраница = 
					Элементы.ГруппаПредупреждение;
		КонецЕсли;
		
		Если ЭтоНовый Тогда
			Если Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет
			 ИЛИ Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
				Заголовок = НСтр("ru='Дополнительный отчет (создание)';uk='Додатковий звіт (створення)'");
			Иначе
				Заголовок = НСтр("ru='Дополнительная обработка (создание)';uk='Додаткова обробка (створення)'");
			КонецЕсли;
		Иначе
			Если Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет
			 ИЛИ Объект.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
				Заголовок = Объект.Наименование + " " + НСтр("ru='(Дополнительный отчет)';uk='(Додатковий звіт)'");
			Иначе
				Заголовок = Объект.Наименование + " " + НСтр("ru='(Дополнительная обработка)';uk='(Додаткова обробка)'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьБыстрыйДоступОбщийОбработчик(ТекущиеДанные)
	
	Идентификатор = ТекущиеДанные.Идентификатор;
	
	ТекущиеДанныеЭлементКоллекции = КомандыОбработки.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор))[0];
	
	Результат = ОткрытьФормуМодально("Справочник.ДополнительныеОтчетыИОбработки.Форма.БыстрыйДоступКДополнительнымОтчетамИОбработкам",
					Новый Структура("ПользователиСБыстрымДоступом, ПредставлениеКоманды", 
									ТекущиеДанныеЭлементКоллекции.БыстрыйСписокДоступа,
									ТекущиеДанные.Представление));
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		ТекущиеДанныеЭлементКоллекции.БыстрыйСписокДоступа.Очистить();
		Для Каждого ЭлементПользователь Из Результат Цикл
			ТекущиеДанныеЭлементКоллекции.БыстрыйСписокДоступа.Добавить(ЭлементПользователь.Значение);
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
	ТекущиеДанныеЭлементКоллекции.БыстрыйДоступПредставление = ПредставлениеБыстрогоДоступаПользователей(
		ТекущиеДанныеЭлементКоллекции.БыстрыйСписокДоступа.Количество()
	);
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьДиалогЗагрузкиФайлаОбработкиОтчета(ФлагДобавить, ПараметрыРегистрации = Неопределено)
	
	// Выбор файла
	Если ПараметрыРегистрации = Неопределено Тогда
		ПараметрыРегистрации = Новый Структура("ИмяФайла, ЭтоОтчет, ОтключатьКонфликтующие, Конфликтующие");
		ПараметрыРегистрации.ИмяФайла = "";
		ПараметрыРегистрации.ЭтоОтчет = Неопределено;
		ПараметрыРегистрации.ОтключатьКонфликтующие = Ложь;
		ПараметрыРегистрации.Конфликтующие = Новый СписокЗначений;
		
		// Параметры результата выбора
		ВыбранноеИмяФайла = "";
		
		// Параметры выбора
		Если ПодключитьРасширениеРаботыСФайлами() Тогда
			
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
			ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ИмяФайла;
			ДиалогОткрытияФайла.Фильтр = ДополнительныеОтчетыИОбработкиКлиентСервер.ФильтрДиалоговВыбораИСохранения();
			ДиалогОткрытияФайла.ИндексФильтра = ?(Объект.Вид = ВидДополнительныйОтчет ИЛИ Объект.Вид = ВидОтчет, 0, 1);
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите дополнительный отчет или обработку';uk='Виберіть додатковий звіт або обробку'");
			
			ПомещаемыеФайлы = Новый Массив;
			ПомещенныеФайлы = Новый Массив;
			
			Если НЕ ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, ДиалогОткрытияФайла, Истина, УникальныйИдентификатор) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			АдресДанныхОбработки = ПомещенныеФайлы[0].Хранение;
			ВыбранноеИмяФайла = ПомещенныеФайлы[0].Имя;
			
		Иначе
			
			Если НЕ ПоместитьФайл(АдресДанныхОбработки, , ВыбранноеИмяФайла, Истина, УникальныйИдентификатор) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранноеИмяФайла, "\");
		ПараметрыРегистрации.ИмяФайла = МассивПодстрок.Получить(МассивПодстрок.ВГраница());
		РасширениеФайла = ВРег(Прав(ПараметрыРегистрации.ИмяФайла, 3));
		
		Если РасширениеФайла = "ERF" Тогда
			ПараметрыРегистрации.ЭтоОтчет = Истина;
		ИначеЕсли РасширениеФайла = "EPF" Тогда
			ПараметрыРегистрации.ЭтоОтчет = Ложь;
		Иначе
			Предупреждение(НСтр("ru='Расширение файла не соответствует расширению внешнего отчета (ERF) или обработки (EPF).';uk=' Розширення файлу не відповідає розширенню зовнішнього звіту (ERF) або обробки (EPF).'"));
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Вызов сервера
	РезультатРегистрации = ЗарегистрироватьОбработку(ПараметрыРегистрации);
	
	// Обработка результата работы сервера
	Если РезультатРегистрации.Успешно = Истина Тогда
		
		РегистрацияОбработки = Истина;
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя(
			НСтр("ru='Файл обработки успешно загружен';uk='Файл обробки успішно завантажений'"), 
			?(ЭтоНовый, "", ПолучитьНавигационнуюСсылку(Объект.Ссылка)), 
			ПараметрыРегистрации.ИмяФайла
		);
		Возврат Истина;
		
	КонецЕсли;
	
	// Разбор причины отказа загрузки обработки и отображение информации пользователю
	Если РезультатРегистрации.ИмяОбъектаЗанято = Ложь Тогда
		
		// Причина отказа в КраткоеПредставлениеОшибки
		Предупреждение(РезультатРегистрации.КраткоеПредставлениеОшибки);
		Возврат Ложь;
		
	Иначе 
		
		// Причина отказа - имя объекта занято
		ЗаголовокВопроса = НСтр("ru='Имя объекта занято';uk=""Ім'я об'єкта зайняте""");
		
		// Представление занявших объектов
		КоличествоКонфликтующих = РезультатРегистрации.Конфликтующие.Количество();
		ПредставлениеЗанявших = "";
		Для Каждого ЭлементСписка Из РезультатРегистрации.Конфликтующие Цикл
			ПредставлениеЗанявших = ПредставлениеЗанявших 
			+ ?(ПредставлениеЗанявших = "", "", ", ")
			+ СокрЛП(ЭлементСписка.Представление);
			Если СтрДлина(ПредставлениеЗанявших) > 80 Тогда
				ПредставлениеЗанявших = Лев(ПредставлениеЗанявших, 70) 
				+ "... ("
				+ Формат(КоличествоКонфликтующих, "ЧН=0; ЧГ=")
				+ " "
				+ НСтр("ru='шт';uk='шт'") 
				+ ")";
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Имя ""%1"" уже занято другими дополнительными отчетами (обработками): "
"%2."
""
"Доступные действия:"
"1. ""Продолжить"" - продолжить загрузку, отключив Публикацию текущего отчета (обработки)."
"2. ""Отключить конфликтующие"" - продолжить загрузку, отключив Публикацию отчетов (обработок), конфликтующих с загружамой по имени."
"3. ""Показать конфликтующие"" - отменить загрузку и показать список отчетов (обработок), конфликтующих с загружамой по имени."
"4. ""Отмена"" - отменить загрузку.';uk='Имя ""%1"" уже занято другими дополнительными отчетами (обработками): "
"%2."
""
"Доступные действия:"
"1. ""Продолжить"" - продолжить загрузку, отключив Публикацию текущего отчета (обработки)."
"2. ""Отключить конфликтующие"" - продолжить загрузку, отключив Публикацию отчетов (обработок), конфликтующих с загружамой по имени."
"3. ""Показать конфликтующие"" - отменить загрузку и показать список отчетов (обработок), конфликтующих с загружамой по имени."
"4. ""Отмена"" - отменить загрузку.'"),
			РезультатРегистрации.ИмяОбъекта,
			ПредставлениеЗанявших
		);
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(1, НСтр("ru='Продолжить';uk='Продовжити'"));
		КнопкиВопроса.Добавить(2, НСтр("ru='Отключить конфликтующие';uk='Відключити конфліктуючі'"));
		КнопкиВопроса.Добавить(3, НСтр("ru='Показать конфликтующие';uk='Показати конфліктуючі'"));
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена);
		
		Ответ = Вопрос(ТекстВопроса, КнопкиВопроса, , 1, ЗаголовокВопроса);
		Если Ответ = 1 Тогда
			
			// Продолжить
			Объект.Публикация = ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки");
			
			// Повторный вызов сервера (публикация в режиме отладки) и обработка результата
			Возврат ОткрытьДиалогЗагрузкиФайлаОбработкиОтчета(ФлагДобавить, ПараметрыРегистрации);
			
		ИначеЕсли Ответ = 2 Тогда
			
			// Отключить конфликтующие
			ПараметрыРегистрации.ОтключатьКонфликтующие = Истина;
			ПараметрыРегистрации.Конфликтующие = РезультатРегистрации.Конфликтующие;
			
			// Повторный вызов сервера (с переводом конфликтующих в режим отладки) и обработка результата
			РезультатВторогоЗахода = ОткрытьДиалогЗагрузкиФайлаОбработкиОтчета(ФлагДобавить, ПараметрыРегистрации);
			
			// Отключается несколько объектов, потому динамические списки надо обновить
			ОповеститьОбИзменении(Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки"));
			
			// Возврат результата вызывающему коду
			Возврат РезультатВторогоЗахода;
			
		ИначеЕсли Ответ = 3 Тогда
			
			// Показать конфлиткующие (отмена далее)
			Если КоличествоКонфликтующих = 1
				И (
					ЭтоНовый 
					ИЛИ РезультатРегистрации.СтароеИмяОбъекта <> РезультатРегистрации.ИмяОбъекта
				) Тогда
				
				// Форма элемента
				ОткрытьЗначение(РезультатРегистрации.Конфликтующие[0].Значение);
				
			Иначе
				
				// Форма списка с отбором по конфликтующим
				ПараметрыСписка = Новый Структура("Отбор, Заголовок, Отображение");
				ПараметрыСписка.Отбор = Новый Структура("ИмяОбъекта, ЭтоГруппа", РезультатРегистрации.ИмяОбъекта, Ложь);
				ПараметрыСписка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Дополнительные отчеты и обработки с именем объекта ""%1""';uk='Додаткові звіти й обробки з іменем об''єкта ""%1""'"),
					РезультатРегистрации.ИмяОбъекта
				);
				ПараметрыСписка.Отображение = "Список";
				ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаСписка", ПараметрыСписка, , Истина);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// Отменить загрузку
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция РедактированиеРасписанияРегламентногоЗадания(Расписание)
	
	Если Расписание = Неопределено Тогда
		
		Расписание = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	// открываем диалог для редактирования Расписания
	Если Диалог.ОткрытьМодально() Тогда
		
		Расписание = Диалог.Расписание;
		
	КонецЕсли;
	
	Возврат Расписание;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРасписание(ТекущиеДанные, Отказ = Ложь)
	
	Если ТекущиеДанные.Расписание.Количество() > 0 Тогда
		Расписание = ТекущиеДанные.Расписание.Получить(0).Значение;
	Иначе
		Расписание = Неопределено;
	КонецЕсли;
	
	Расписание = РедактированиеРасписанияРегламентногоЗадания(Расписание);
	
	ТекущиеДанные.Расписание.Очистить();
	ТекущиеДанные.Расписание.Добавить(Расписание);
	
	ТекущиеДанные.РасписаниеПредставление = Строка(Расписание);
	
	Если ТекущиеДанные.РасписаниеПредставление = ПредставлениеПустогоРасписания() Тогда
		ТекущиеДанные.РасписаниеПредставление = стрРасписаниеНеЗадано();
		ТекущиеДанные.Использование = Ложь;
		Отказ = Истина;
	Иначе
		ТекущиеДанные.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПустогоРасписания()
	
	Возврат Строка(Новый РасписаниеРегламентногоЗадания);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция стрРасписаниеНеЗадано()
	
	Возврат НСтр("ru='Расписание не задано';uk='Розклад не заданий'");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеБыстрогоДоступаПользователей(КоличествоПользователей)
	Если КоличествоПользователей = 0 Тогда
		Возврат НСтр("ru='Команды нет в быстром доступе';uk='Команди немає у швидкому доступі'");
	КонецЕсли;
	
	ПоследняяЦифра = КоличествоПользователей - 10 * Цел(КоличествоПользователей/10);
	
	Если ПоследняяЦифра = 1 Тогда
		БыстрыйДоступПредставление = НСтр("ru='%1 пользователь';uk='%1 користувач'");
	ИначеЕсли ПоследняяЦифра = 2 Или ПоследняяЦифра = 3 Или ПоследняяЦифра = 4 Тогда
		БыстрыйДоступПредставление = НСтр("ru='%1 пользователя';uk='%1 користувача'");
	Иначе
		БыстрыйДоступПредставление = НСтр("ru='%1 пользователей';uk='%1 користувачів'");
	КонецЕсли;
	
	БыстрыйДоступПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		БыстрыйДоступПредставление, 
		Формат(КоличествоПользователей, "ЧГ=0")
	);
	
	Возврат БыстрыйДоступПредставление;
КонецФункции
